package nested;

/**
 * Created by Yuriy on 21.02.2016.
 */
public class PrintFirst10 {
    public static void main(String[] args) {
        int i=1; //оголошуємо змінну і, що є числом від 1 до 300
        int countResult=0; // змінна, що рахує кількість чисел, що відповідають вимогам
        for(i=1;i<=300;i++){//і приймає значення від 1 до 300
            if(i%3==0|i%4==0){//перевірка на ділення на 3 та 4 (записуємо умову щоб залишок дорівнював нулю)
                countResult+=1;//після кожного виконання умови іф збільшуємо лічильник на одиницю
                if(countResult>10){ //якщо кількість перевищить одиницю припинити цикл
                    break;
                }
                System.out.println(i);
            }
        }
    }
}
